In [68]:
square = lambda x: x**3
print(square(5))

125

In [69]:
numbers = [2, 3, 4, 5, 6]
squares = map(lambda x: x**3, numbers)
print(list(squares))  # [1, 4, 9, 16, 25]

[8, 27, 64, 125, 216]

In [70]:
cat = 'cat'
dog = 'dog'
cow = 'cow'
lion = 'lion'
animal = dog
ret=  cow if animal is cat else lion if animal is dog else lion
print(ret)

lion

In [71]:
ret= dog if animal is dog else cat if animal is cat else cat
print(ret)

dog

In [72]:
cat = 'cat'
dog = 'dog'
cow = 'cow'
lion = 'lion'
animal  = cow
ret = None
if animal is cat:
    ret = cat
elif animal is dog:
    ret = dog
elif animal is cow :
    ret = cow
else :
    ret = lion
print(ret)

cow

In [73]:
arr = ["a","b","c"]
def solution(arr):
    return ''.join(arr)
solution(arr)

'abc'

In [74]:
import pandas as pd
import numpy as np
frame = pd.DataFrame([[np.nan, np.nan, np.nan, np.nan],
                     [1,2,3,4],
                     [5,6,7,8],
                     [9,10,11,np.nan]],
                     index=['가a','나b','다c','라d'],
                     columns=['a가','b나','c다','d라'],)
frame

     a가    b나    c다   d라
가a  NaN   NaN   NaN  NaN
나b  1.0   2.0   3.0  4.0
다c  5.0   6.0   7.0  8.0
라d  9.0  10.0  11.0  NaN

In [75]:
frame.dropna() # NaN 이 포함 된 모든 행이 사라짐

     a가   b나   c다   d라
나b  1.0  2.0  3.0  4.0
다c  5.0  6.0  7.0  8.0

In [76]:
frame.dropna(how='all') # NaN이 있는 행만 삭제
# how : any, all 있음  all은 행과 열에 전부 있을때 삭제(해당 줄 전체가 NaN이면 삭제)
# any 는 NaN가 포함된 요소의 모든 행렬을 삭제

     a가    b나    c다   d라
나b  1.0   2.0   3.0  4.0
다c  5.0   6.0   7.0  8.0
라d  9.0  10.0  11.0  NaN

In [77]:
frame.fillna(0) # method : ffill, bfill, backfill, 'pad',None
# NaN 자리에 0으로 대체 () 입력값에 따라

     a가    b나    c다   d라
가a  0.0   0.0   0.0  0.0
나b  1.0   2.0   3.0  4.0
다c  5.0   6.0   7.0  8.0
라d  9.0  10.0  11.0  0.0

In [78]:
frame.fillna({'a가':10, 'c다':3})
# # x1 NaN에 10, x3 NaN에 3, 딕셔너리로 해당 값 입력

      a가    b나    c다   d라
가a  10.0   NaN   3.0  NaN
나b   1.0   2.0   3.0  4.0
다c   5.0   6.0   7.0  8.0
라d   9.0  10.0  11.0  NaN

In [79]:
frame.isna().sum() # 결축치가 몇개인지 알려주는거 x4엔 NaN 2개 있음
# frame.isnull().sum() 위와 같음

a가    1
b나    1
c다    1
d라    2
dtype: int64

In [80]:
data = pd.DataFrame({'id':['0001', '0002', '0003', '0001'],
                     'name':['a','b','c','a']})

- 중복 제거
- duplicated() : 각 row가 중복인지(True) 아닌지(False) 알려주는 불리언

In [81]:
data.duplicated() # 중복 체크, True 중복O

0    False
1    False
2    False
3     True
dtype: bool

In [82]:
data.drop_duplicates() # 중복 삭제

     id name
0  0001    a
1  0002    b
2  0003    c

- cut 함수

In [83]:
ages = [20,30,67,39,59,44,56,77,28,80,32,46,52,19,33,5,15,50,29,21,33,48,85,80,31,10]
bins = [0,20,40,60,100]

In [84]:
cuts = pd.cut(ages, bins) # 범주화/ 묶기/ 카테고리 // 구간 자름
# bins가 구간 0~20, …, 60~100으로 카테고리를 나누고,
# # 해당 범주에 맞는 요소가 많은 것 부터 차례로 나열
cuts

[(0, 20], (20, 40], (60, 100], (20, 40], (40, 60], ..., (40, 60], (60, 100], (60, 100], (20, 40], (0, 20]]
Length: 26
Categories (4, interval[int64, right]): [(0, 20] < (20, 40] < (40, 60] < (60, 100]]

In [85]:
cuts.categories # cut 메소드의 결과는 categorical이라는 특수 객체에 존재. 구간을 나눠줌

IntervalIndex([(0, 20], (20, 40], (40, 60], (60, 100]], dtype='interval[int64, right]')

In [86]:
cuts.codes # 각 요소의 구간인덱스를 알려줌
# 해당 요소의 카테고리 인덱스를 반환

array([0, 1, 3, 1, 2, 2, 2, 3, 1, 3, 1, 2, 2, 0, 1, 0, 0, 2, 1, 1, 1, 2,
       3, 3, 1, 0], dtype=int8)

In [87]:
group_names = ["10대이하", "20~30대", "40~50대", "60대 이상"]
pd.cut(ages, bins, labels=group_names)
# ages 리스트를 bins로 나누어 4개의 구간으로 나눈 후, 
# group_names 리스트를 label로 갖는 각 구간에 대한 label이 지정된 결과를 반환

['10대이하', '20~30대', '60대 이상', '20~30대', '40~50대', ..., '40~50대', '60대 이상', '60대 이상', '20~30대', '10대이하']
Length: 26
Categories (4, object): ['10대이하' < '20~30대' < '40~50대' < '60대 이상']

In [88]:
pd.cut(ages,4,precision=1).value_counts() # 구간을 균등한 길이로 나눔. 구간 값이 균등
# precision : 소수점 자릿수, 3이면 소수점 세번째에서 반올림
# 객체에 대해 value_counts() 각 구간에 속하는 데이터의 갯수를 세어준 결과를 출력

(4.9, 25.0]     6
(25.0, 45.0]    9
(45.0, 65.0]    6
(65.0, 85.0]    5
Name: count, dtype: int64

In [89]:
pd.qcut(ages,4).value_counts()
# qcut 구간을 균등하게 나눔, 분포인원 균등
# 4개의 동일한 구간으로 분할하고, 각 구간에 속한 데이터 포인트의 개수를 세어 출력

(4.999, 28.25]    7
(28.25, 36.0]     6
(36.0, 55.0]      6
(55.0, 85.0]      7
Name: count, dtype: int64

- get_dummines
- 명목형 변수를(수치형X) 문자형 원핫(OneHot) 인코딩 해줌.
  - pd.get_dummies(df) 함수는 데이터프레임 내의 범주형 변수를  
  더미 변수(dummy variable)로 변환해주는 함수  
  (수치형 변수는 숫자로 이루어진 변수,  
  범주형 변수는 문자열, 정수, 카테고리 등으로 이루어진 변수들)

  - 수치형 변수는 숫자로 이루어진 변수를 말하며, 연속형 변수와 이산형 변수로 나뉩니다.  
    1. 연속형 변수: 정해진 범위 안에서 모든 값을 가질 수 있는 변수
    2. 이산형 변수: 정수와 같이 연속적이지 않은 값을 가지는 변수  

  - 범주형 변수는 명목형 변수와 순서형 변수로 나뉩니다.  
    1. 명목형 변수: 순서가 없는 카테고리형 변수(ex. 성별, 지역, 직업 등)
    
    2. 순서형 변수: 범주 간에 순서가 있는 변수(ex. 학점 등급, 만족도 등)

정수로 이루어져 있어도 변수의 의미에 따라서  
  수치형 변수일 수도, 범주형 변수일 수도 있음

사람의 성별을 나타내는 변수는 0과 1로 인코딩하더라도 범주형 변수입니다.  
반면에, 사람의 연령을 나타내는 변수는 정수 값으로  
인코딩하고 그 의미가 연속적인 값이라면 수치형 변수입니다.  
하지만 그 값이 나이의 범주를 나타내는 것이라면  
범주형 변수일 수도 있습니다.  
따라서 변수의 의미와 데이터 분석의 목적에 따라서 변수의 유형을 결정해야 함

In [90]:
df = pd.DataFrame({'col1':[10,20,30],  # column1
                   'col2':['a','b','c']}) #  column2
df # col1, col2 열이 있는 DataFrame 출력

   col1 col2
0    10    a
1    20    b
2    30    c

In [91]:
pd.get_dummies(df)
# 범주형 변수가 존재하는 열들을 더미 변수로 변환하고,
# 해당 더미 변수를 새로운 열로 추가
# 범주형 변수가 아닌 수치형 변수는 그대로 유지

   col1  col2_a  col2_b  col2_c
0    10    True   False   False
1    20   False    True   False
2    30   False   False    True

In [92]:
df = pd.DataFrame({'col1':['001','002','003','004','005','006'],
                   'col2':[10,20,30,40,50,60],
                   'col3':['서울시','경기도','서울시','제주도','경기도','서울시']})
df
# arr_col2 = df['col2'].to_numpy().reshape(-1, 2)  
# reshape는 numpy 함수로 사용하려면 위 코드를 작성하여
# pd.DataFrame을 numpy로 바꿔서 사용

  col1  col2 col3
0  001    10  서울시
1  002    20  경기도
2  003    30  서울시
3  004    40  제주도
4  005    50  경기도
5  006    60  서울시

In [93]:
pd.get_dummies(df) # 1:True, 0:False 유효하지 않은 분석
# 원핫(onehot)쓰면 스팔스 매트릭스(sparse matrix)대부분의 요소가 0인 행렬 자주,많이 발생

,col2,col1_001,col1_002,col1_003,col1_004,col1_005,col1_006,col3_경기도,col3_서울시,col3_제주도
0,10,True,False,False,False,False,False,False,True,False
1,20,False,True,False,False,False,False,True,False,False
2,30,False,False,True,False,False,False,False,True,False
3,40,False,False,False,True,False,False,False,False,True
4,50,False,False,False,False,True,False,True,False,False
5,60,False,False,False,False,False,True,False,True,False

In [94]:
import pandas as pd
kbo = pd.read_csv('https://raw.githubusercontent.com/the9world/My_Study/main/Z_running_file/kbo.csv') # file load 
kbo

      연도  순위    팀  경기수   승   패  무     승률   게임차
0   2019   1   두산  144  88  55  1  0.615   0.0
1   2019   2   키움  144  86  57  1  0.601   2.0
2   2019   3   SK  144  88  55  1  0.615   0.0
3   2019   4   LG  144  79  64  1  0.552   9.0
4   2019   5   NC  144  73  69  2  0.514  14.5
5   2019   6   KT  144  71  71  2  0.500  16.5
6   2019   7  KIA  144  62  80  2  0.437  25.5
7   2019   8   삼성  144  60  83  1  0.420  28.0
8   2019   9   한화  144  58  86  0  0.403  30.5
9   2019  10   롯데  144  48  93  3  0.340  39.0
10  2018   1   두산  144  93  51  0  0.646 -14.5
11  2018   2   SK  144  78  65  1  0.545   0.0
12  2018   3   한화  144  77  67  0  0.535   1.5
13  2018   4   넥센  144  75  69  0  0.521   3.5
14  2018   5  KIA  144  70  74  0  0.486   8.5
15  2018   5   삼성  144  68  72  4  0.486   8.5
16  2018   7   롯데  144  68  74  2  0.479   9.5
17  2018   8   LG  144  68  75  1  0.476  10.0
18  2018   9   KT  144  59  82  3  0.418  18.0
19  2018  10   NC  144  58  85  1  0.406  20.0
20  2017   1  KIA  144  87  56  1  0.608   0.0
21  2017   2   두산  144  84  57  3  0.596   2.0
22  2017   3   롯데  144  80  62  2  0.563   6.5
23  2017   4   NC  144  79  62  3  0.560   7.0
24  2017   5   SK  144  75  68  1  0.524  12.0
25  2017   6   LG  144  69  72  3  0.489  17.0
26  2017   7   넥센  144  69  73  2  0.486  17.5
27  2017   8   한화  144  61  81  2  0.430  25.5
28  2017   9   삼성  144  55  84  5  0.396  30.0
29  2017  10   KT  144  50  94  0  0.347  37.5

In [95]:
kbo.shape # 30열 9행, (열과 행의 갯수를 알려줌)

(30, 9)

In [96]:
kbo.columns # 칼럼즈 columns 열들 title(?)을 알려줌

Index(['연도', '순위', '팀', '경기수', '승', '패', '무', '승률', '게임차'], dtype='object')

In [97]:
kbo['팀'].unique # '팀' 열의 중복 이름을 가진 팀 제거

<bound method Series.unique of 0      두산
1      키움
2      SK
3      LG
4      NC
5      KT
6     KIA
7      삼성
8      한화
9      롯데
10     두산
11     SK
12     한화
13     넥센
14    KIA
15     삼성
16     롯데
17     LG
18     KT
19     NC
20    KIA
21     두산
22     롯데
23     NC
24     SK
25     LG
26     넥센
27     한화
28     삼성
29     KT
Name: 팀, dtype: object>

In [98]:
kbo.info() # csv 정보

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 30 entries, 0 to 29
Data columns (total 9 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   연도      30 non-null     int64
 1   순위      30 non-null     int64
 2   팀       30 non-null     object
 3   경기수     30 non-null     int64
 4   승       30 non-null     int64
 5   패       30 non-null     int64
 6   무       30 non-null     int64
 7   승률      30 non-null     float64
 8   게임차     30 non-null     float64
dtypes: float64(2), int64(6), object(1)
memory usage: 2.2+ KB

In [99]:
kbo.describe() # 디스크라이브, 각 수치 count …mean … 50% … max

,연도,순위,경기수,승,패,무,승률,게임차
count,30.000000,30.000000,30.0,30.000000,30.000000,30.000000,30.000000,30.000000
mean,2018.000000,5.466667,144.0,71.200000,71.200000,1.600000,0.499800,12.833333
std,0.830455,2.921187,0.0,11.871147,11.591912,1.275769,0.082079,12.576204
min,2017.000000,1.000000,144.0,48.000000,51.000000,0.000000,0.340000,-14.500000
25%,2017.000000,3.000000,144.0,61.250000,62.500000,1.000000,0.431750,2.375000
50%,2018.000000,5.000000,144.0,70.500000,71.500000,1.000000,0.494500,9.750000
75%,2019.000000,8.000000,144.0,79.000000,80.750000,2.000000,0.558000,19.500000
max,2019.000000,10.000000,144.0,93.000000,94.000000,5.000000,0.646000,39.000000

In [100]:
kbo.isna().sum() # 결측치(NaN, None) 확인 및 나열

연도     0
순위     0
팀      0
경기수    0
승      0
패      0
무      0
승률     0
게임차    0
dtype: int64

- groupby를 하면 group으로 묶인 Groupby 객체를 반환
    - 이 객체는 그룹 연산을 위해 필요한 모든 정보를 가지고 있음.
    - 새로운 정보를 추출 할 수 있음

In [101]:
kbo.groupby('팀') # 팀' 기준으로 그룹핑
#  '팀'을 가진 데이터끼리 묶어서 다양한 집계 함수들을 적용 가능

In [102]:
kbo.groupby('팀').count() # 총 수를 카운트, 넥센->키움, 팀 이름 바뀜
# 팀별로 몇 개의 데이터가 있는지를 확인, dataframe의 각 열마다
# 값이 있는 데이터의 개수를 세는 것이기 때문에 결과 값은 모두 같음

     연도  순위  경기수  승  패  무  승률  게임차
팀
KIA   3   3    3  3  3  3   3    3
KT    3   3    3  3  3  3   3    3
LG    3   3    3  3  3  3   3    3
NC    3   3    3  3  3  3   3    3
SK    3   3    3  3  3  3   3    3
넥센    2   2    2  2  2  2   2    2
두산    3   3    3  3  3  3   3    3
롯데    3   3    3  3  3  3   3    3
삼성    3   3    3  3  3  3   3    3
키움    1   1    1  1  1  1   1    1
한화    3   3    3  3  3  3   3    3

In [103]:
kbo.groupby(['연도','팀']).sum() # pivot table
# 연도와 팀으로 그룹화한 뒤, 각 그룹 내에서 숫자형 데이터의 합계를 계산하는 작업

          순위  경기수   승   패  무     승률   게임차
연도   팀
2017 KIA   1  144  87  56  1  0.608   0.0
     KT   10  144  50  94  0  0.347  37.5
     LG    6  144  69  72  3  0.489  17.0
     NC    4  144  79  62  3  0.560   7.0
     SK    5  144  75  68  1  0.524  12.0
     넥센    7  144  69  73  2  0.486  17.5
     두산    2  144  84  57  3  0.596   2.0
     롯데    3  144  80  62  2  0.563   6.5
     삼성    9  144  55  84  5  0.396  30.0
     한화    8  144  61  81  2  0.430  25.5
2018 KIA   5  144  70  74  0  0.486   8.5
     KT    9  144  59  82  3  0.418  18.0
     LG    8  144  68  75  1  0.476  10.0
     NC   10  144  58  85  1  0.406  20.0
     SK    2  144  78  65  1  0.545   0.0
     넥센    4  144  75  69  0  0.521   3.5
     두산    1  144  93  51  0  0.646 -14.5
     롯데    7  144  68  74  2  0.479   9.5
     삼성    5  144  68  72  4  0.486   8.5
     한화    3  144  77  67  0  0.535   1.5
2019 KIA   7  144  62  80  2  0.437  25.5
     KT    6  144  71  71  2  0.500  16.5
     LG    4  144  79  64  1  0.552   9.0
     NC    5  144  73  69  2  0.514  14.5
     SK    3  144  88  55  1  0.615   0.0
     두산    1  144  88  55  1  0.615   0.0
     롯데   10  144  48  93  3  0.340  39.0
     삼성    8  144  60  83  1  0.420  28.0
     키움    2  144  86  57  1  0.601   2.0
     한화    9  144  58  86  0  0.403  30.5

In [104]:
kbo.groupby('팀')['승률'].max()
# groupby('팀')를 통해 팀별로 데이터를 묶은 후, ['승률']을 선택하여
# 승률 열에 대해서만 계산을 수행합니다.
# 그리고 max()를 호출하여 승률 열에서 최댓값을 구합니다

팀
KIA    0.608
KT     0.500
LG     0.552
NC     0.560
SK     0.615
넥센     0.521
두산     0.646
롯데     0.563
삼성     0.486
키움     0.601
한화     0.535
Name: 승률, dtype: float64

In [105]:
# 각 팀별 내용을 보여줌
grouped = kbo.groupby('팀') # groupby('팀')을 통해 '팀' 열을 기준으로 그룹화하고 변수를 만듬
for name,group in grouped: # for 문을 이용하여 각 그룹을 출력합니다.
# name 변수에는 그룹화한 열의 이름인 '팀'의 각 값이 할당되며,
# group 변수에는 해당 그룹의 데이터프레임이 할당
    print(name)
    print(group)
    print('-'*5)
# print(name)은 그룹화한 '팀'의 각 값(팀 이름)을 출력하고, 
# print(group)은 해당 팀의 모든 데이터를 출력합니다.
# print('-'*5)는 각 그룹의 구분을 위해 구분선을 출력하는 역할

KIA
      연도  순위    팀  경기수   승   패  무     승률   게임차
6   2019   7  KIA  144  62  80  2  0.437  25.5
14  2018   5  KIA  144  70  74  0  0.486   8.5
20  2017   1  KIA  144  87  56  1  0.608   0.0
-----
KT
      연도  순위   팀  경기수   승   패  무     승률   게임차
5   2019   6  KT  144  71  71  2  0.500  16.5
18  2018   9  KT  144  59  82  3  0.418  18.0
29  2017  10  KT  144  50  94  0  0.347  37.5
-----
LG
      연도  순위   팀  경기수   승   패  무     승률   게임차
3   2019   4  LG  144  79  64  1  0.552   9.0
17  2018   8  LG  144  68  75  1  0.476  10.0
25  2017   6  LG  144  69  72  3  0.489  17.0
-----
NC
      연도  순위   팀  경기수   승   패  무     승률   게임차
4   2019   5  NC  144  73  69  2  0.514  14.5
19  2018  10  NC  144  58  85  1  0.406  20.0
23  2017   4  NC  144  79  62  3  0.560   7.0
-----
SK
      연도  순위   팀  경기수   승   패  무     승률   게임차
2   2019   3  SK  144  88  55  1  0.615   0.0
11  2018   2  SK  144  78  65  1  0.545   0.0
24  2017   5  SK  144  75  68  1  0.524  12.0
-----
넥센
      연도  순위   팀  경기수   승   패  무     승률   게임차
13  2018   4  넥센  144  75  69  0  0.521   3.5
26  2017   7  넥센  144  69  73  2  0.486  17.5
-----
두산
      연도  순위   팀  경기수   승   패  무     승률   게임차
0   2019   1  두산  144  88  55  1  0.615   0.0
10  2018   1  두산  144  93  51  0  0.646 -14.5
21  2017   2  두산  144  84  57  3  0.596   2.0
-----
롯데
      연도  순위   팀  경기수   승   패  무     승률   게임차
9   2019  10  롯데  144  48  93  3  0.340  39.0
16  2018   7  롯데  144  68  74  2  0.479   9.5
22  2017   3  롯데  144  80  62  2  0.563   6.5
-----
삼성
      연도  순위   팀  경기수   승   패  무     승률   게임차
7   2019   8  삼성  144  60  83  1  0.420  28.0
15  2018   5  삼성  144  68  72  4  0.486   8.5
28  2017   9  삼성  144  55  84  5  0.396  30.0
-----
키움
     연도  순위   팀  경기수   승   패  무     승률  게임차
1  2019   2  키움  144  86  57  1  0.601  2.0
-----
한화
      연도  순위   팀  경기수   승   패  무     승률   게임차
8   2019   9  한화  144  58  86  0  0.403  30.5
12  2018   3  한화  144  77  67  0  0.535   1.5
27  2017   8  한화  144  61  81  2  0.430  25.5
-----

In [106]:
import pandas as pd

df = pd.read_csv('https://raw.githubusercontent.com/paskhaver/pandas-in-action/master/chapter_01_introducing_pandas/movies.csv', index_col='Title')
df

                              Rank           Studio       Gross  Year
Title
Avengers: Endgame                1      Buena Vista  $2,796.30   2019
Avatar                           2              Fox  $2,789.70   2009
Titanic                          3        Paramount  $2,187.50   1997
Star Wars: The Force Awakens     4      Buena Vista  $2,068.20   2015
Avengers: Infinity War           5      Buena Vista  $2,048.40   2018
...                            ...              ...         ...   ...
Yogi Bear                      778  Warner Brothers    $201.60   2010
Garfield: The Movie            779              Fox    $200.80   2004
Cats & Dogs                    780  Warner Brothers    $200.70   2001
The Hunt for Red October       781        Paramount    $200.50   1990
Valkyrie                       782              MGM    $200.30   2008

[782 rows x 4 columns]

In [107]:
df.shape # 총 행과 열 반환

(782, 4)

In [108]:
df.size # DataFrame의 원소의 총 개수를 반환합니다.
# 이 값은 DataFrame의 행과 열 개수의 곱과 같음

3128

In [109]:
df.iloc[499] # f.iloc[499]에서 iloc은 레이블이 아닌 정수 인덱스를 사용하여
# 데이터에 액세스하는 인덱서입니다. df.iloc[0]은 첫 번째 행, [499]는 500 번째 행

Rank           500
Studio         Fox
Gross     $288.30
Year          2018
Name: Maze Runner: The Death Cure, dtype: object

In [110]:
df.loc['Forrest Gump'] #  인덱스 라벨이 "Forrest Gump"인 행을 반환
# 인덱스 레이블에는 중복 항목이 있을 수 있음.

Rank            119
Studio    Paramount
Gross      $677.90
Year           1994
Name: Forrest Gump, dtype: object

In [111]:
df.sort_values(by='Year', ascending=False).head()
# df를 Year 열을 기준으로 내림차순으로 정렬하고, 그 중에서 상위 5개의 행을 출력
# 최근 영화 순으로 상위 5개의 영화를 보여줌
# ascending=False는 내림차순, DataFrame을 정렬할 기준이 되는 열(column)의 이름을 지정하는 것을 의미

,Rank,Studio,Gross,Year
Title,,,,
Avengers: Endgame,1,Buena Vista,"$2,796.30",2019
John Wick: Chapter 3 - Parabellum,458,Lionsgate,$304.70,2019
The Wandering Earth,114,China Film Corporation,$699.80,2019
Toy Story 4,198,Buena Vista,$519.80,2019
How to Train Your Dragon: The Hidden World,199,Universal,$519.80,2019

In [112]:
df.sort_values(by=['Studio', 'Year']).head()
# Studio'와 'Year' 컬럼을 기준으로 데이터프레임을 오름차순으로 정렬한 뒤 상위 5개의 행을 출력

                         Rank       Studio     Gross  Year
Title
The Blair Witch Project   588      Artisan  $248.60   1999
101 Dalmatians            708  Buena Vista  $215.90   1961
The Jungle Book           755  Buena Vista  $205.80   1967
Who Framed Roger Rabbit   410  Buena Vista  $329.80   1988
Dead Poets Society        636  Buena Vista  $235.90   1989

In [113]:
df.sort_index().head()
# 인덱스 순서대로 상위 5개 나열 sort_index(기본 오름차순)

                  Rank           Studio     Gross  Year
Title
10,000 B.C.        536  Warner Brothers  $269.80   2008
101 Dalmatians     708      Buena Vista  $215.90   1961
101 Dalmatians     425      Buena Vista  $320.70   1996
2 Fast 2 Furious   632        Universal  $236.40   2003
2012                93             Sony  $769.70   2009

In [114]:
df['Studio'] =='Universal'
# DataFrame에서 'Studio' 열의 값이 'Universal'인 경우에는 True,
# 그렇지 않은 경우에는 False

Title
Avengers: Endgame               False
Avatar                          False
Titanic                         False
Star Wars: The Force Awakens    False
Avengers: Infinity War          False
                                ...
Yogi Bear                       False
Garfield: The Movie             False
Cats & Dogs                     False
The Hunt for Red October        False
Valkyrie                        False
Name: Studio, Length: 782, dtype: bool

In [115]:
df[df['Studio']== 'Universal']
# Studio 열의 값이 Universal인 행들만 추출하여 새로운 데이터 프레임 생성

                                Rank     Studio       Gross  Year
Title
Jurassic World                     6  Universal  $1,671.70   2015
Furious 7                          8  Universal  $1,516.00   2015
Jurassic World: Fallen Kingdom    13  Universal  $1,309.50   2018
The Fate of the Furious           17  Universal  $1,236.00   2017
Minions                           19  Universal  $1,159.40   2015
...                              ...        ...         ...   ...
The Break-Up                     763  Universal    $205.00   2006
Everest                          766  Universal    $203.40   2015
Patch Adams                      772  Universal    $202.30   1998
Kindergarten Cop                 775  Universal    $202.00   1990
Straight Outta Compton           776  Universal    $201.60   2015

[109 rows x 4 columns]

- 20015년 개봉한 영화 필터링

In [118]:
df[((df['Studio']== 'Universal') & (df['Year']==2015))]
# & 비트연산자로 해야됨 and 아님

                        Rank     Studio       Gross  Year
Title
Jurassic World             6  Universal  $1,671.70   2015
Furious 7                  8  Universal  $1,516.00   2015
Minions                   19  Universal  $1,159.40   2015
Fifty Shades of Grey     165  Universal    $571.00   2015
Pitch Perfect 2          504  Universal    $287.50   2015
Ted 2                    702  Universal    $216.70   2015
Everest                  766  Universal    $203.40   2015
Straight Outta Compton   776  Universal    $201.60   2015

In [119]:
df[((df['Studio']=='Universal') | (df['Year']==2015))] # | 은 or 비트연산자

                                Rank       Studio       Gross  Year
Title
Star Wars: The Force Awakens       4  Buena Vista  $2,068.20   2015
Jurassic World                     6    Universal  $1,671.70   2015
Furious 7                          8    Universal  $1,516.00   2015
Avengers: Age of Ultron            9  Buena Vista  $1,405.40   2015
Jurassic World: Fallen Kingdom    13    Universal  $1,309.50   2018
...                              ...          ...         ...   ...
The Break-Up                     763    Universal    $205.00   2006
Everest                          766    Universal    $203.40   2015
Patch Adams                      772    Universal    $202.30   1998
Kindergarten Cop                 775    Universal    $202.00   1990
Straight Outta Compton           776    Universal    $201.60   2015

[140 rows x 4 columns]

In [121]:
# 1983년에서 1986년 사이에 개봉한 영화를 필터링 하는 예제
mid_80s=df['Year'].between(1983,1986) # between, range로 대체 가능하다함
df[mid_80s] # between는 해당 열의 값이 주어진 범위에 속하는지 검사하여 불리언 시리즈 반환

                                      Rank     Studio     Gross  Year
Title
Return of the Jedi                     222        Fox  $475.10   1983
Back to the Future                     311  Universal  $381.10   1985
Top Gun                                357  Paramount  $356.80   1986
Indiana Jones and the Temple of Doom   403  Paramount  $333.10   1984
Crocodile Dundee                       413  Paramount  $328.20   1986
Beverly Hills Cop                      432  Paramount  $316.40   1984
Rocky IV                               467        MGM  $300.50   1985
Rambo: First Blood Part II             469    TriStar  $300.40   1985
Ghostbusters                           485   Columbia  $295.20   1984
Out of Africa                          662  Universal  $227.50   1985

- 인덱스에서 영화 제목을 소문자로 바꾸고 제목에 'drak'라는 단어가 있는 모든 영화를 찾는 예제

In [ ]:
has_dark_in_title = df.index.str.lower().str.contains('dark')
# 인덱스의 문자열에 대해 문자열 메서드를 사용할 수 있도록 하는 기능
# lower()로 모두 소문자로 변환하고, contains()로 dark를 검색하여 불리언 값 반환
df[has_dark_in_title] # 데이터프레임의 인덱스 중 'dark' 문자열을 포함하는 항목만 반환

- 어떤 제작사가 제작한 영화의 수익이 가장 높은지 알아보기
- 원본 cvs에서 달러 기호와 쉼표 기호를 유지하기 위해 열의 값을 텍스트로 가져온다
- 열의 값을 십진수로 변환하려면 두 가지 기호('$, ',')를 모두 제거하고 빈 텍스트로 변환

In [122]:
df['Gross'].str.replace(
    "$","",regex=False
).str.replace(",","",regex=False)
# df['Gross'].str.replace("$","",regex=False) : Gross 열에 포함된 $ 기호를
# 빈 문자열로 대체합니다. regex=False로 설정하여 정규식이 아닌 문자열 기준으로 바꿈
# .str.replace(",","",regex=False):  $ 기호를 제거한 결과에 대해,
# 기호를 빈 문자열로 대체함. regex=False로 설정하여 정규식이 아닌 문자열 기준으로 바꿈

Title
Avengers: Endgame               2796.30
Avatar                          2789.70
Titanic                         2187.50
Star Wars: The Force Awakens    2068.20
Avengers: Infinity War          2048.40
                                  ...
Yogi Bear                        201.60
Garfield: The Movie              200.80
Cats & Dogs                      200.70
The Hunt for Red October         200.50
Valkyrie                         200.30
Name: Gross, Length: 782, dtype: object

- replace()는 문자열에서 특정 값 또는 패턴을 찾아서 새로운 값 또는 패턴으로  
  대체하는 메소드입니다.  
  기본적으로 파라미터를 두 개 받음.  
  첫 번째는 바꿀 값(value)이고 두 번째는 새로운 값(replace)

  Hello, World!"라는 문자열에서 ","를 ""(빈 문자열)로 치환하려면  
  replace(",", "")와 같이 regex=False를 지정

  "Hello, World!"에서 모든 알파벳을 대문자로 바꾸려면  
  replace("[a-zA-Z]+", lambda m: m.group(0).upper(), regex=True)와  
  같이 정규식 패턴을 사용할 수 있음

In [123]:
df['Gross']=(
    df['Gross']
 .str.replace("$","",regex=False)
.str.replace(",","",regex=False)
.astype(float)) # astype(float): float 타입으로 변환
# $와 ,을 공백으로 바꿔줌

In [124]:
df['Gross'].mean() # 평균 값

439.0308184143222

- 영화 제작사 당 총 흥행 수익을 계산하는 문제
  - 먼저 제작사를 식별하고 각 제작사에 속한 영화(또는 행)을 버킷(bucket)으로 지정해야함
이 과정을 grouping이라고 함.

In [125]:
studios = df.groupby('Studio') # Studio열을 그룹화하여 studios에 넣음
# groupby() 사용하면 지정한 열의 값을 기준으로 데이터를 그룹화할 수 있음

In [126]:
studios['Gross'].count().sort_values(ascending=False).head()
# studio 열에서 Gross를 카운트하고 가장 높은 상위 5개 나열

Studio
Warner Brothers    132
Buena Vista        125
Fox                117
Universal          109
Sony                86
Name: Gross, dtype: int64

In [128]:
studios['Gross'].sum().head()
# Gross를 모두 더하고 상위 5개 나열
# sort_values() 사용하지 않고 그룹화된 Gross 값만 확인하면
# 해당 순서는 그룹화된 데이터 프레임의 순서대로 됩

Studio
Buena Vista        73585.0
Warner Brothers    58643.8
Fox                50420.8
Universal          44302.3
Sony               32822.5
Name: Gross, dtype: float64

In [129]:
studios['Gross'].sum().sort_values(ascending=False).head()

Studio
Buena Vista        73585.0
Warner Brothers    58643.8
Fox                50420.8
Universal          44302.3
Sony               32822.5
Name: Gross, dtype: float64